tap "dart-lang/dart"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"


##################
#### HASKELL #####
##################
# Glorious Glasgow Haskell Compilation System
#brew "ghc"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
#brew "haskell-language-server"


##################
###### FUNNY #####
##################
brew "fortune"
brew "cowsay"
brew "lolcat"
brew "htop"
brew "neofetch"


##################
###### DEVOPS ####
##################
brew "ansible"
brew "ansible-lint"
brew "awscli"
brew "nmap"
brew "wget"
brew "curl"
brew "siege"
brew "pandoc"
brew "perl"
brew "plantuml"
brew "ruby"
brew "cmake"
brew "librsvg"
brew "graphviz"
brew "libfido2"
brew "libpq"
brew "libraw"
brew "libsndfile"
brew "libssh"
brew "openssl@3"
brew "blueutil"
brew "coreutils"
brew "nvm"
brew "tfenv"
brew "tflint"


###################
###### PYTHON #####
###################
# Interpreted, interactive, object-oriented programming language
#brew "python@3.9"


##################
##### OTHER ######
##################
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Network authentication protocol
brew "krb5"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Generate introspection data for GObject libraries
brew "gobject-introspection"


##################
##### NVIM #######
##################
brew "fd"
brew "fzf"
brew "ripgrep"
brew "fmt"
brew "kitty"
brew "lazygit"


##################
##### CASKS ######
##################
cask "db-browser-for-sqlite"
cask "font-fira-code"
cask "mactex"
