tap "craftcms/nitro"
tap "dart-lang/dart"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "sass/sass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Official Amazon AWS command-line interface
brew "awscli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Apache HTTP server
brew "httpd", restart_service: true
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql", restart_service: true
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php", restart_service: true
# Web interface for MySQL and MariaDB
brew "phpmyadmin"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# HTTP regression testing and benchmarking utility
brew "siege"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Nitro is a speedy Docker-based local development environment tuned for Craft CMS
brew "craftcms/nitro/nitro"
# Packer
brew "hashicorp/tap/packer"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
cask "font-fira-code"
# GraphQL IDE for better development workflows
cask "graphql-playground"
cask "java"
# Full TeX Live distribution with GUI applications
cask "mactex"
